#include <stdio.h>
#include <string.h>
#include <stdlib.h>


struct s{
    char name[10];
}s1;

void save(){
    FILE *fp= fopen("information.txt","w");
    fprintf(fp,"%s","cxk");
    fclose(fp);
}

char name[10];

int main() {
    printf("***************欢迎使用校园出入管理系统***************\n");
    printf("---------------------------------------------------\n");
    printf("---------------1.录入出入校园人员信息----------------\n");
    printf("---------------2.保存出入校园人员信息----------------\n");
    printf("---------------3.浏览出入校园人员信息----------------\n");
    printf("---------------4.查询出入校园人员信息----------------\n");
    printf("---------------5.增加出入校园人员信息----------------\n");
    printf("---------------6.删除出入校园人员信息----------------\n");
    printf("---------------7.修改出入校园人员信息----------------\n");
    printf("---------------8.统计出入校园人员信息----------------\n");
    printf("---------------9.对出入校园人员信息进行排序-----------\n");
    printf("---------------10.退出-----------------------------\n");
    printf("**************************************************\n");

    while (1) {
        printf("请选择(1-10)：");
        int op;
        scanf("%d", &op);
        switch (op) {
            case 2:
                save();
                break;
            case 10:
                printf("退出系统\n");
                return 0;
        }
    }
}
