#include "stdio.h"



int main() {
    //输入身份证号
    char a[20];
    printf("请输入身份证号：");
    scanf("%s", a);

    //身份证验证
    long long sum = 0;
    long long b[18];
//    第一步：将前面的身份证号码17位数分别乘以不同的系数
    for (int i = 0; i < 17; i++) {
        b[i] = (a[i] - '0') * (2 << (16 - i));
        sum += b[i];
    }
//    第二步：将这17位数字和系数相乘的结果相加
//    第三步：用加出来和除以11，看余数是多少
    int c = sum % 11;
//    第四步：余数只可能有0 1 2 3 4 5 6 7 8 9 10这11个数字
//    其分别对应的最后一位身份证的号码为1 0 X 9 8 7 6 5 4 3 2
    char d[11] = {'1', '0', 'x', '9', '8', '7', '6', '5', '4', '3', '2'};
//    第五步：通过上面得知如果余数是2，就会在身份证的第18位数字上出现罗马数字x。
//    如果余数是10，身份证的最后一位号码就是2。
    if (d[c] == a[17]) {
        printf("身份证号码正确");
        //出生年月
        int year = (a[6] - '0') * 1000 + (a[7] - '0') * 100 + (a[8] - '0') * 10 + (a[9] - '0');
        int month = (a[10] - '0') * 10 + (a[11] - '0');
        int day = (a[12] - '0') * 10 + (a[13] - '0');
        printf("出生年月：%d年%d月%d日\n", year, month, day);
    } else {
        printf("身份证号码错误");
    }
    return 0;
}
//11010519491231002x
//440524198001010013